app/controllers/admin/news_controller.rb

  def create
    @admin_news = Admin::News.new(params[:admin_news])

    respond_to do |format|
      if @admin_news.save
---
INSERT INTO "admin_news" ("created_at", "description", "link", "published", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @admin_news = Admin::News.find(params[:id])

    respond_to do |format|
      if @admin_news.update_attributes(params[:admin_news])
---
UPDATE "admin_news" SET "published" = 't', "updated_at" = '2014-05-13 16:43:24.485934' WHERE "admin_news"."id" = 2

  def destroy

    @admin_news = Admin::News.find(params[:id])
    @admin_news.destroy
---
DELETE FROM "admin_news" WHERE "admin_news"."id" = ?  [["id", 4]]