app/controllers/sessions_controller.rb

SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."provider" = 'facebook' AND "authorizations"."uid" = '10152782585244692' LIMIT 1
INSERT INTO "authorizations" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 11 May 2014 11:11:06 UTC +00:00], ["provider", "facebook"], ["uid", "10152782585244692"], ["updated_at", Sun, 11 May 2014 11:11:06 UTC +00:00], ["user_id", 1]]
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 11 May 2014 11:11:06 UTC +00:00], ["email", "debasys@gmail.com"], ["name", "Debashis Mandal"], ["updated_at", Sun, 11 May 2014 11:11:06 UTC +00:00]]
---
  def create

    auth_hash = request.env['omniauth.auth']
    #    render :text => auth_hash.inspect

    @authorization = Authorization.find_by_provider_and_uid(auth_hash["provider"], auth_hash["uid"])
    if @authorization
      render :text => "Welcome back #{@authorization.user.name}! You have already signed up."
    else
      user = User.new :name => auth_hash["info"]["name"], :email => auth_hash["info"]["email"]
      user.authorizations.build :provider => auth_hash["provider"], :uid => auth_hash["uid"]
      user.save